// @flow
const map = {
  a: 'àáâãäåāăąǎǟǡǻȁȃȧɐḁẚạảấầẩẫậắằẳẵặⓐⱥａАа',
  A: 'ÀÁÂÃÄÅĀĂĄǍǞǠǺȀȂȦȺḀẠẢẤẦẨẪẬẮẰẲẴẶⒶⱯＡ',
  aa: 'ꜳ',
  Aa: 'Ꜳ',
  ae: 'æǣǽ',
  Ae: 'ǢǼ',
  ao: 'ꜵ',
  Ao: 'Ꜵ',
  au: 'ꜷ',
  Au: 'Ꜷ',
  av: 'ꜹꜻ',
  Av: 'ꜸꜺ',
  ay: 'ꜽ',
  AY: 'Ꜽ',
  b: 'ƀƃɓḃḅḇⓑｂб',
  B: 'ƁƂɃḂḄḆⒷＢБ',
  c: 'çćĉċčƈȼḉↄⓒꜿｃ',
  C: 'ÇĆĈĊČƇȻḈⒸꜾＣ',
  d: 'ďđƌɖɗḋḍḏḑḓⓓꝺｄд',
  D: 'ĎĐƉƊƋḊḌḎḐḒⒹꝹＤД',
  dz: 'ǆǳ',
  DZ: 'ǄǱ',
  Dz: 'ǅǲ',
  e: 'èéêëēĕėęěǝȅȇȩɇɛḕḗḙḛḝẹẻẽếềểễệⓔｅеэ',
  E: 'ÈÉÊËĒĔĖĘĚƎƐȄȆȨḔḖḘḚḜẸẺẼẾỀỂỄỆⒺＥЕЭ',
  f: 'ƒḟⓕꝼｆф',
  F: 'ƑḞⒻꝻＦФ',
  g: 'ĝğġģǥǧǵɠᵹḡⓖꝿꞡｇг',
  G: 'ĜĞĠĢƓǤǦǴḠⒼꝽꝾꞠＧГ',
  h: 'ĥħȟɥḣḥḧḩḫẖⓗⱨⱶｈх',
  H: 'ĤĦȞḢḤḦḨḪⒽⱧⱵꞍＨХ',
  hv: 'ƕ',
  I: 'ÌÍÎÏĨĪĬĮİƗǏȈȊḬḮỈỊⒾＩЙЫИ',
  i: 'ìíîïĩīĭįıǐȉȋɨḭḯỉịⓘｉйыи',
  j: 'ĵǰɉⓙｊ',
  J: 'ĴɈⒿＪ',
  K: 'ĶƘǨḰḲḴⓀⱩꝀꝂꝄꞢＫК',
  k: 'ķƙǩḱḳḵⓚⱪꝁꝃꝅꞣｋк',
  l: 'ĺļľŀłſƚɫḷḹḻḽⓛⱡꝇꝉꞁｌл',
  L: 'ĹĻĽĿŁȽḶḸḺḼⓁⱠⱢꝆꝈꞀＬЛ',
  lj: 'ǉ',
  Lj: 'ǈ',
  m: 'ɯɱḿṁṃⓜｍм',
  M: 'ƜḾṀṂⓂⱮＭМ',
  n: 'ñńņňŉƞǹɲṅṇṉṋⓝꞑꞥｎн',
  N: 'ÑŃŅŇƝǸȠṄṆṈṊⓃꞐꞤＮН',
  nj: 'ǌ',
  Nj: 'ǋ',
  o: 'òóôõöøōŏőơǒǫǭǿȍȏȫȭȯȱɔɵṍṏṑṓọỏốồổỗộớờởỡợⓞꝋꝍｏо',
  O: 'ÒÓÔÕÖØŌŎŐƆƟƠǑǪǬǾȌȎȪȬȮȰṌṎṐṒỌỎỐỒỔỖỘỚỜỞỠỢⓄꝊꝌＯО',
  oi: 'ƣ',
  Oi: 'Ƣ',
  oo: 'ꝏ',
  Oo: 'Ꝏ',
  ou: 'ȣ',
  OU: 'Ȣ',
  p: 'ƥᵽṕṗⓟꝑꝓꝕｐп',
  P: 'ƤṔṖⓅⱣꝐꝒꝔＰП',
  q: 'ɋⓠꝗꝙｑ',
  Q: 'ɊⓆꝖꝘＱ',
  r: 'ŕŗřȑȓɍɽṙṛṝṟⓡꝛꞃꞧｒр',
  R: 'ŔŖŘȐȒɌṘṚṜṞⓇⱤꝚꞂꞦＲР',
  s: 'ßśŝşšșȿṡṣṥṧṩẛⓢꞅꞩｓс',
  S: 'ŚŜŞŠȘṠṢṤṦṨẞⓈⱾꞄꞨＳС',
  t: 'ţťŧƭțʈṫṭṯṱẗⓣⱦꞇｔт',
  T: 'ŢŤŦƬƮȚȾṪṬṮṰⓉꞆＴТ',
  tz: 'ꜩ',
  Tz: 'Ꜩ',
  u: 'ùúûüũūŭůűųưǔǖǘǚǜȕȗʉṳṵṷṹṻụủứừửữựⓤｕу',
  U: 'ÙÚÛÜŨŪŬŮŰŲƯǓǕǗǙǛȔȖɄṲṴṶṸṺỤỦỨỪỬỮỰⓊＵУ',
  v: 'ʋʌṽṿⓥꝟｖв',
  V: 'ƲɅṼṾⓋꝞＶВ',
  vy: 'ꝡ',
  Vy: 'Ꝡ',
  w: 'ŵẁẃẅẇẉẘⓦⱳｗ',
  W: 'ŴẀẂẄẆẈⓌⱲＷ',
  x: 'ẋẍⓧｘ',
  X: 'ẊẌⓍＸ',
  y: 'ýÿŷƴȳɏẏẙỳỵỷỹỿⓨｙ',
  Y: 'ÝŶŸƳȲɎẎỲỴỶỸỾⓎＹ',
  z: 'źżžƶȥɀẑẓẕⓩⱬꝣｚз',
  Z: 'ŹŻŽƵȤẐẒẔⓏⱫⱿꝢＺЗ',
  Yo: 'Ё',
  Ts: 'Ц',
  Sh: 'Ш',
  Sch: 'Щ',
  "'": 'ЪъЬь',
  yo: 'ё',
  ts: 'ц',
  sh: 'ш',
  sch: 'щ',
  Zh: 'Ж',
  zh: 'ж',
  Ya: 'Я',
  Ch: 'Ч',
  Yu: 'Ю',
  ya: 'я',
  ch: 'ч',
  yu: 'ю',
};

const reverse: { [any]: string } = {};

// populate `reverse` with substitutions
for (const char in map) {
  // $FlowFixMe[invalid-computed-prop]
  const unicode = map[char].split('');
  for (let i = 0; i < unicode.length; i++) {
    reverse[unicode[i]] = char;
  }
}

// generate a regular expression which will match any supported
// unicode characters
const regex = new RegExp(`[${Object.keys(reverse).join('')}]`, 'g');
const nonAscii = /[^\x00-\x7F]/g; // eslint-disable-line no-control-regex

function undress(input: string): string {
  return (`${input}`)
    .replace(regex, (char) => reverse[char])
    .replace(nonAscii, 'X');
}

module.exports = undress;
